yazidta/Flying-Probe-Tester/STM32/Core/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
//   /*c = axes[0].motors[0]->currentPositionMM;
   //TMC2209_MoveTo(&axes[0], 0, 100); // Axis X, Motor X1*/
   //TMC2209_MoveTo(&axes[1], 0, -100); // Axis X, Motor X1
 // Axis X, Motor X1
   //TMC2209_Step(&motors[1], 3200);
//   TMC2209_SetDirection(&motors[0], dir);
     TMC2209_SetSpeed(&motors[0], 25000);
//   TMC2209_SetDirection(&motors[1], dir);
     TMC2209_SetSpeed(&motors[1], 12000);
//   TMC2209_SetDirection(&motors[2], dir);
   TMC2209_SetSpeed(&motors[2], 25000);
//   //TMC2209_Step(&motors[0], 6400);
//   TMC2209_Step(&motors[1], 6400);
   //TMC2209_Step(&motors[2], 6400);
   //TMC2209_Step(&motors[3], 6400);
   //TMC2209_EnableDriver(&motors[0], 1);
   //TMC2209_EnableDriver(&motors[1], 1);
   //TMC2209_EnableDriver(&motors[2], 1);
   //TMC2209_EnableDriver(&motors[3], 1);
   CheckConnection(&hservo2,&hservo1);

//   SERVO_WritePosition(&hservo1, 70);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo1, 50);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo1, 90);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo2, 72);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo2, 52);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo2, 92);
//   HAL_Delay(300);

//   SERVO_WritePosition(&hservo2, 50);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo2, 60);
//   HAL_Delay(300);
//   SERVO_WritePosition(&hservo2, 40);
//   HAL_Delay(300);
   while (1){

      if (Flag) // Adjust based on button state
      {

    	         //TMC2209_Step(&motors[1], 16000);
    	         //TMC2209_Start(&motors[0]);
    	         //TMC2209_Start(&motors[1]);


    	         MotorsHoming(&motors);
//    	         stepsTaken[0] = 0;
//    	         HAL_Delay(200);
    	         //TMC2209_MoveTo(&axes[0], 0, -100); // Axis X, Motor X1
    	  	  	 Flag = 0;

      }
      //TMC2209_MoveTo(&axes[0], 0, -100); // Axis X, Motor X1
//
     es = IsSensorTriggered(EndStop4_GPIO_Port,EndStop4_Pin);
      x = IsSensorTriggered(EndStop3_GPIO_Port,EndStop3_Pin);
      sensorX1=IsSensorTriggered(EndStop1_GPIO_Port, EndStop1_Pin);
      xx =IsSensorTriggered(EndStop2_GPIO_Port, EndStop2_Pin);
      //xx= CheckConnection(&hservo2,&hservo1);


      sensorX1 = HAL_GPIO_ReadPin(BtnLeft_GPIO_Port,BtnLeft_Pin);

      if(es && x &&sensorX1 && xx){
      xx =+1;
      }
      else{
    	  xx = 0;
      }
      while(xx >= 1){
      MotorControl_ButtonHandler(&motors);
      }
////           //TMC2209_SetDirection(&motors[0], 1);
//      for(int i =0; i < 3;i++){
//	         //TMC2209_Step(&motors[0], 6400);
//	         TMC2209_MoveTo(&axes[0], 0, move[i]);

//
//
//// Axis X, Motor X1
//	         //TMC2209_Stop(&motors[0]);
//      }
//       }

//       c = axes[0].motors[0]->currentPositionMM;

	  //Flag = HAL_GPIO_ReadPin(GPIOC,USER_Btn_Pin);
	  //uint32_t encode = ENC_GetCounter(&henc1);
//          // Show the menu and get the user's choice
         //uint8_t choice = LCD_I2C_MainMenu_Encoder(&hlcd3, &henc1);
//
////
////          // Handle the selected option using the encapsulated function
          //LCD_I2C_HandleMenuSelection(choice, &hlcd3,&henc1);



      }

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 216;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV4;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.Timing = 0x20404768;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief SPI2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI2_Init(void)
{

  /* USER CODE BEGIN SPI2_Init 0 */

  /* USER CODE END SPI2_Init 0 */

  /* USER CODE BEGIN SPI2_Init 1 */

